In [1]:
import pandas as pd

In [9]:
#1-1
data={'이름':['메로나','비비빅','죠스바'],
      '가격':[300,400,250],
      '재고':[20,3,100]}

In [10]:
data=pd.DataFrame(data)
data

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

In [11]:
#1-2
print(data.index,data.columns)

RangeIndex(start=0, stop=3, step=1) Index(['이름', '가격', '재고'], dtype='object')

In [19]:
#1-3
data[['가격']]

    가격
0  300
1  400
2  250

In [18]:
#1-4
data[['이름','재고']]

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

In [22]:
#1-5
data.iloc[[1]]

    이름   가격  재고
1  비비빅  400   3

In [21]:
#1-6
data.iloc[[0,2]]

    이름   가격   재고
0  메로나  300   20
2  죠스바  250  100

In [26]:
#1-7 행 인덱스 변경

In [31]:
#1-8
data['총가격']=0
data

    이름   가격   재고  총가격
0  메로나  300   20    0
1  비비빅  400   23    0
2  죠스바  250  100    0

In [38]:
#1-9
data.loc[3]=('빵빠레',550,10,0)
data

    이름   가격   재고  총가격
0  메로나  300   20    0
1  비비빅  400   23    0
2  죠스바  250  100    0
3  빵빠레  550   10    0

In [30]:
#1-10
data.iloc[1,2]=23
data

    이름   가격   재고
0  메로나  300   20
1  비비빅  400   23
2  죠스바  250  100

In [67]:
#2-1
data2={'시가':[2000,7500,15450],
      '고가':[3050,2050,15050],
      '저가':[2050,2050,15550],
      '종가':[1980,1980,14900]}

In [69]:
data2=pd.DataFrame(data2)
data2

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [40]:
#2-2

3-1: 데이터
3-2: dataframe
3-3: sereis
3-4: dataframe
! 3-5: array
3-6:series
3-7:series
3-8: dataframe